Revit 2026 API

# DirectShapeReferenceOptions Class

---

This class is used to control the behavior of DirectShape and DirectShapeType reference objects.

SystemObject Autodesk.Revit.DBDirectShapeReferenceOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DirectShapeReferenceOptions : IDisposable
```
```vb
Public Class DirectShapeReferenceOptions
	Implements IDisposable
```
```cpp
public ref class DirectShapeReferenceOptions : IDisposable
```
```fsharp
type DirectShapeReferenceOptions =
    class
        interface IDisposable
    end
```

The DirectShapeReferenceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DirectShapeReferenceOptions | Constructs a new DirectShapeRefOptions instance with default settings. |
|  | DirectShapeReferenceOptions(DirectShapeReferenceOptions) | Constructs a new copy of the input DirectShapeRefOptions object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DirectShapeReferenceOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExternalGeometryId | Retrieves the ExternalGeometryId associated with the reference object. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidExternalGeometryId | Validates that the input ExternalGeometryId can be assigned to a direct shape reference. |
|  | IsValidReferenceName | Validates that the input name can be assigned to a direct shape reference. |
|  | SetExternalGeometryId | Sets the ExternalGeometryId associated with the reference object. The ID must be non-empty. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace